Merge pull request #2 from ghimele/docs-update
